Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_uart.cpp
  /* Transmit Data */
  UARTx->DR = (Data & (uint16_t)0x0FF);
}

/**
  * @brief  Returns the most recent received data by the UARTx peripheral.
  * @param  UARTx: Select the UART peripheral.
  *         This parameter can be one of the following values:
  *         UART1, UART2.
  * @retval The received data (7:0) and error flags (15:8).
  */
uint16_t UART_ReceiveData(MDR_UART_TypeDef* UARTx)
{
  /* Check the parameters */
  assert_param(IS_UART_ALL_PERIPH(UARTx));

  /* Receive Data */
  return (uint16_t)(UARTx->DR);
}

/**
  * @brief  Break transmit.
  * @param  UARTx: Select the UART peripheral.
  *         This parameter can be one of the following values:
  *         UART1, UART2.
  * @param  NewState: new state of the Line.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_BreakLine(MDR_UART_TypeDef* UARTx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_UART_ALL_PERIPH(UARTx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set BRK bit in the UART LCR_H register */
    UARTx->LCR_H |= LCR_H_BRK_Set;
  }
  else
  {
    /* Reset BRK bit in the UART LCR_H register */
    UARTx->LCR_H |= LCR_H_BRK_Reset;
  }
}

/**
  * @brief  Configures the UART's IrDA interface.
  * @param  UARTx: Select the UART peripheral.
  *         This parameter can be one of the following values:
  *         UART1, UART2.
  * @param  UART_IrDAMode: specifies the IrDA mode.
  *         This parameter can be one of the following values:
  *           @arg UART_IrDAMode_LowPower
  *           @arg UART_IrDAMode_Normal
  * @retval None
  */
void UART_IrDAConfig(MDR_UART_TypeDef* UARTx, uint32_t UART_IrDAMode)
{
  uint32_t cpuclock;
  RST_CLK_FreqTypeDef RST_CLK_Clocks;

  /* Check the parameters */
  assert_param(IS_UART_ALL_PERIPH(UARTx));
  assert_param(IS_UART_IRDA_MODE(UART_IrDAMode));

  if (UART_IrDAMode == UART_IrDAMode_LowPower)
  {
    /* Configure the UART ILPR */
    RST_CLK_GetClocksFreq(&RST_CLK_Clocks);
    cpuclock = RST_CLK_Clocks.CPU_CLK_Frequency;
    UARTx->ILPR = cpuclock / IrLPBaud16;
  }
  UARTx->CR |= UART_IrDAMode;
}

/**
  * @brief  Enables or disables the UART's IrDA interface.
  * @param  UARTx: Select the UART peripheral.
  *         This parameter can be one of the following values:
  *         UART1, UART2.
  * @param  NewState: new state of the IrDA mode.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_IrDACmd(MDR_UART_TypeDef* UARTx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_UART_ALL_PERIPH(UARTx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set SIREN bit in the UART CR register */
    UARTx->CR |= CR_SIREN_Set;
  }
  else
  {
    /* Reset SIREN bit in the UART CR register */
    UARTx->CR |= CR_SIREN_Reset;
  }
}

/**
  * @brief  Checks whether the specified UART flag is set or not.
  * @param  UARTx: Select the UART or the UART peripheral.
  *         This parameter can be one of the following values:
  *         UART1, UART2, UART3, UART4 or UART5.
  * @param  UART_FLAG: specifies the flag to check.
  *         This parameter can be one of the following values:
  *           @arg UART_FLAG_RI  : nUARTRI line inverted value
  *           @arg UART_FLAG_TXFE: Transmit buffer is empty flag
  *           @arg UART_FLAG_RXFF: Receive buffer is full flag
  *           @arg UART_FLAG_TXFF: Transmit buffer is full flag
  *           @arg UART_FLAG_RXFE: Receive buffer is empty flag
  *           @arg UART_FLAG_BUSY: Transmit Busy flag
  *           @arg UART_FLAG_DCD:  nUARTDCD line inverted value
  *           @arg UART_FLAG_DSR:  nUARTDSR line inverted value
  *           @arg UART_FLAG_CTS:  nUARTCTS line inverted value
  * @retval The new state of UART_FLAG (SET or RESET).
  */
FlagStatus UART_GetFlagStatus(MDR_UART_TypeDef* UARTx, uint32_t UART_FLAG)
{
  FlagStatus bitstatus;

  /* Check the parameters */
  assert_param(IS_UART_ALL_PERIPH(UARTx));
  assert_param(IS_UART_FLAG(UART_FLAG));

  if (UARTx->FR & UART_FLAG)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Initializes the UARTx peripheral Clock according to the
  *         specified parameters.
  * @param  UARTx: Select the UART peripheral.
  *         This parameter can be one of the following values:
  *         UART1, UART2.
  * @param  UART_BRG: specifies the HCLK division factor.
  *         This parameter can be one of the following values:
  *           @arg UART_HCLKdiv1
  *           @arg UART_HCLKdiv2
  *           @arg UART_HCLKdiv4
  *           @arg UART_HCLKdiv8
  *           @arg UART_HCLKdiv16
  *           @arg UART_HCLKdiv32
  *           @arg UART_HCLKdiv64
  *           @arg UART_HCLKdiv128
  * @retval None
  */
void UART_BRGInit(MDR_UART_TypeDef* UARTx, uint32_t UART_BRG)
{
  uint32_t tmpreg;

  /* Check the parameters */
  assert_param(IS_UART_ALL_PERIPH(UARTx));
  assert_param(IS_UART_CLOCK_BRG(UART_BRG));


#if defined (USE_MDR1986VE3)
  if((UARTx == MDR_UART3) || (UARTx == MDR_UART4))
	  tmpreg = MDR_RST_CLK->UART_SSP_CLOCK;
  else
#endif
  tmpreg = MDR_RST_CLK->UART_CLOCK;


  if (UARTx == MDR_UART1)
  {
    tmpreg |= RST_CLK_UART_CLOCK_UART1_CLK_EN;
    tmpreg &= ~RST_CLK_UART_CLOCK_UART1_BRG_Msk;
    tmpreg |= UART_BRG;
  }
  else if (UARTx == MDR_UART2)
  {
    tmpreg |= RST_CLK_UART_CLOCK_UART2_CLK_EN;
    tmpreg &= ~RST_CLK_UART_CLOCK_UART2_BRG_Msk;
    tmpreg |= (UART_BRG << 8);
  }
#if defined (USE_MDR1901VC1T)
  else if( UARTx == MDR_UART3)
  {
	  tmpreg |= RST_CLK_UART_CLOCK_UART3_CLK_EN;
	  tmpreg &= ~ RST_CLK_UART_CLOCK_UART3_BRG_Msk;
	  tmpreg |= (UART_BRG << RST_CLK_UART_CLOCK_UART3_BRG_Pos);
  }
#endif
#if defined (USE_MDR1986VE3)
  else if(UARTx == MDR_UART3)
  {
	  tmpreg |= RST_CLK_UART_SSP_CLOCK_UART3_CLK_EN;
	  tmpreg &= ~RST_CLK_UART_SSP_CLOCK_UART3_BRG_Msk;
	  tmpreg |= (UART_BRG << RST_CLK_UART_SSP_CLOCK_UART3_BRG_Pos);
  }
  else if(UARTx == MDR_UART4)
  {
	  tmpreg |= RST_CLK_UART_SSP_CLOCK_UART4_CLK_EN;
	  tmpreg &= ~RST_CLK_UART_SSP_CLOCK_UART4_BRG_Msk;
	  tmpreg |= (UART_BRG << RST_CLK_UART_SSP_CLOCK_UART4_BRG_Pos);
  }
#endif

#if defined (USE_MDR1986VE3)
  if((UARTx == MDR_UART3) || (UARTx == MDR_UART4))
	  MDR_RST_CLK->UART_SSP_CLOCK = tmpreg;
  else
#endif
  MDR_RST_CLK->UART_CLOCK = tmpreg;
}

/** @} */ /* End of group UART_Private_Functions */

/** @} */ /* End of group UART */

/** @} */ /* End of group __MDR32F9Qx_StdPeriph_Driver */

/*
*
* END OF FILE MDR32F9Qx_uart.c */

